---
kind: method
id: M:Autodesk.Revit.DB.Structure.Hub.GetHubConnectorManager
source: html/801d16cd-b376-423a-e159-160f9afa18a9.htm
---
# Autodesk.Revit.DB.Structure.Hub.GetHubConnectorManager Method

Retrieves the ConnectorManager of the Hub.

## Syntax (C#)
```csharp
public ConnectorManager GetHubConnectorManager()
```

## Returns
The ConnectorManager.

## Remarks
The ConnectorManager provides information about elements connected via the Hub.